romkatv/powerlevel10k
mdumitru/fancy-ctrl-z
Atlas34/fzf-plugin # need fzf package to install on linux
Freed-Wu/zsh-command-not-found
ael-code/zsh-colored-man-pages
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions # zsh-autosuggestions
redxtech/zsh-kitty # completion, need kitty terminal
zsh-users/zsh-completions # completion
# marlonrichert/zsh-autocomplete # real time completion
# MenkeTechnologies/zsh-more-completions
wfxr/forgit # delta, bat, exa need to install on linux 
jimhester/per-directory-history
Aloxaf/fzf-tab #zstyle ':completion:*:descriptions' format '[%d]' after install, if doesnt work, look at zsh-ls-colors #zstyle ':fzf-tab:*' fzf-flags $(echo $FZF_DEFAULT_OPTS) after install, to force default from zshrc
jeffreytse/zsh-vi-mode
